html/dev.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>dev</title>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8"/>
<meta name="title" content="dev"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2015-03-31T16:13+0800"/>
<meta name="author" content="ZHAO Xin"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>
<link rel="stylesheet" type="text/css" href="css/default.css"/>

</head>
<body>

<div id="preamble">

</div>

<div id="content">
<h1 class="title">dev</h1>


<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">MyMachine</a>
<ul>
<li><a href="#sec-1-1">eeepc 1005pe 无线网卡 linux 驱动</a></li>
<li><a href="#sec-1-2">openwrt 多拨</a>
<ul>
<li><a href="#sec-1-2-1">路由缓存</a></li>
<li><a href="#sec-1-2-2">设置虚拟网卡</a></li>
<li><a href="#sec-1-2-3">在 mwan3 添加新的 wan 接口</a></li>
<li><a href="#sec-1-2-4">编辑 mwan3 接口的时候注意最后一行</a></li>
<li><a href="#sec-1-2-5">multiwan对相同网关的路由不能有效地叠加，所以要修改/lib/netifd/ppp-up文件:</a></li>
<li><a href="#sec-1-2-6">多拨成功后配置多路由负载均衡</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1">MyMachine</h2>
<div class="outline-text-2" id="text-1">



</div>

<div id="outline-container-1-1" class="outline-3">
<h3 id="sec-1-1">eeepc 1005pe 无线网卡 linux 驱动 &nbsp;&nbsp;&nbsp;<span class="tag"><span class="eeepc">eeepc</span>&nbsp;<span class="wireless">wireless</span></span></h3>
<div class="outline-text-3" id="text-1-1">

<p>lspci 得到无线网卡设备号，google查找到无线网卡设备。
</p>
<p>
驱动方法：
</p><ol>
<li>ndiswrapper 无法进行破解
</li>
<li>compat-wireless
</li>
</ol>


<p>
第2种方法的驱动安装步骤：
</p><ol>
<li>检查 /lib /modules/`uname-r`/build 文件夹
</li>
<li>./scripts/driver-select ath9k
</li>
<li>make, sudo make install
</li>
<li>sudo modprobe ath9k
</li>
<li>检查安装是否成功
</li>
</ol>




<pre class="src src-shell-script">    iwconfig
    modinfo ath9k
<span style="color: #6c71c4;">alias</span>:          pci:v0000168Cd0000002Csv*sd*bc*sc*i*
</pre>

<ol>
<li>在/etc/modules中加入ath9k, 使驱动开机后自动加载入内核。
</li>
</ol>


<p>
原始安装包装的驱动在无线破解时，生成的监测模式端口mon0在channel -1，导致无法破解。
通过google查找，下载一个patch后，重新安装可解决这个问题。
</p></div>

</div>

<div id="outline-container-1-2" class="outline-3">
<h3 id="sec-1-2">openwrt 多拨 &nbsp;&nbsp;&nbsp;<span class="tag"><span class="openwrt">openwrt</span>&nbsp;<span class="ji2">ji2</span></span></h3>
<div class="outline-text-3" id="text-1-2">


</div>

<div id="outline-container-1-2-1" class="outline-4">
<h4 id="sec-1-2-1">路由缓存</h4>
<div class="outline-text-4" id="text-1-2-1">

<p>用 ip route show cache 查看会看到很多缓存，可以禁用内核的路由缓存，在启动项里面加上 
</p>



<pre class="src src-shell-script"><span style="color: #6c71c4;">echo</span> -1 &gt; /proc/sys/net/ipv4/rt_cache_rebuild_count
ip route flush cache
</pre>

</div>

</div>

<div id="outline-container-1-2-2" class="outline-4">
<h4 id="sec-1-2-2">设置虚拟网卡</h4>
<div class="outline-text-4" id="text-1-2-2">




<pre class="src src-shell-script">ip link add link eth1 vth2 type macvlan     <span style="color: #586e75; font-style: italic;"># </span><span style="color: #586e75; font-style: italic;">eth1&#25351;&#30340;&#26159;&#20320;&#30340;&#22806;&#32593;&#21345;&#65292;vth2&#26159;&#34394;&#25311;&#30340;&#32593;&#21345;&#21517;</span>
ifconfig vth2 hw ether 38-5B-F9-21-46-39    <span style="color: #586e75; font-style: italic;"># </span><span style="color: #586e75; font-style: italic;">mac&#22320;&#22336;&#19981;&#33021;&#30456;&#21516;</span>
ifconfig vth2 up
</pre>


<p>
需要几拨就添加几个虚拟网卡 
然后重启
</p></div>

</div>

<div id="outline-container-1-2-3" class="outline-4">
<h4 id="sec-1-2-3">在 mwan3 添加新的 wan 接口</h4>
<div class="outline-text-4" id="text-1-2-3">

<p>直接在luci里增加多个pppoe interface，编辑每个general setup，设置拨号用户名密码，
advance setting 设置不同 metric
physical settings，把多个wan interface设置成同一个wan vlan下，如 eth0.2
firewall 设置同一个wan区下
</p>
</div>

</div>

<div id="outline-container-1-2-4" class="outline-4">
<h4 id="sec-1-2-4">编辑 mwan3 接口的时候注意最后一行</h4>
<div class="outline-text-4" id="text-1-2-4">




<pre class="example">config interface 'wan1'
option enabled '1'
option reliability '1'
option count '1'
option timeout '2'
option interval '60'
option down '3'
option up '5'
list track_ip '114.114.114.114'
list track_ip '58.216.114.245'
list track_ip '222.185.173.145'
list track_ip '222.184.115.137'
       option 'reroute' '1'
</pre>


</div>

</div>

<div id="outline-container-1-2-5" class="outline-4">
<h4 id="sec-1-2-5">multiwan对相同网关的路由不能有效地叠加，所以要修改/lib/netifd/ppp-up文件:</h4>
<div class="outline-text-4" id="text-1-2-5">


<p>
[ -n "$IPREMOTE" ] &amp;&amp; proto<sub>add</sub><sub>ipv4</sub><sub>route</sub> 0.0.0.0 0 "$IPREMOTE"
修改成：
</p>
<p>
[ -n "$IPREMOTE" ] &amp;&amp; proto<sub>add</sub><sub>ipv4</sub><sub>route</sub> 0.0.0.0 0 "$IPLOCAL"
保存并退出
</p>
</div>

</div>

<div id="outline-container-1-2-6" class="outline-4">
<h4 id="sec-1-2-6">多拨成功后配置多路由负载均衡</h4>
<div class="outline-text-4" id="text-1-2-6">


</div>
</div>
</div>
</div>
</div>

<div id="postamble">
<p class="date">Date: 2015-03-31T16:13+0800</p>
<p class="author">Author: ZHAO Xin</p>
<p class="creator"><a href="http://orgmode.org">Org</a> version 7.9.3f with <a href="http://www.gnu.org/software/emacs/">Emacs</a> version 24</p>
<a href="http://validator.w3.org/check?uri=referer">Validate XHTML 1.0</a>

</div>
</body>
</html>
